app/controllers/movies_controller.rb

  def index
    # byebug
   @all_ratings = Movie.all_ratings
   @sort = params[:sort]    || session[:sort]
   @temp = params[:ratings] || session[:ratings]

  # Save @sort && @temp to a local variable
   session[:sort]    = @sort
   session[:ratings] = @temp

   @selected = @temp == nil ? @all_ratings : @temp.keys

   @movies = Movie.order(@sort).where({rating: @selected})
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date